using UnityEngine;
using System.Collections;
using System.Collections.Generic;

public class BoardM : MonoBehaviour {

	public static BoardM Instance { get; private set; }

	public Transform UIParent;

	public const int WIDTH = 7;
	public const int HEIGHT = 8;
	public const int ITEM_SIZE = 92;

	public int MaxLevel = 1;

	private Dictionary <int, Board> boardDic = new Dictionary<int, Board> ();
	
	void Awake () {
		Instance = this;
		Init ();
        BeginController.Create();
	}
	
	void OnDestroy () {
		Instance = null;
	}

	// 读取关卡配置
	private void Init () {		
		boardDic.Add (0, new Board (1, new List<string> {"同时到达法阵!", "滑动屏幕,左右移动!"}, new List<string> {
			"100,100,100,100,100,100,100,,100,100,100,100,100,100,100"
				,"100,100,100,100,100,100,100,,100,100,100,100,100,100,100"
					,"100,100,100,100,100,100,100,,100,100,100,100,100,100,100"
					,"100,100,100,100,100,100,100,,100,100,100,100,100,100,100"
					,"100,100,56,0,3,0,1,,1,0,0,3,0,100,100"
					,"100,100,100,100,100,100,100,,100,100,100,100,100,100,100"
					,"100,100,100,100,100,100,100,,100,100,100,100,100,100,100"
			,"100,100,100,100,100,100,100,,100,100,100,0,0,0,0"}));

		boardDic.Add (1, new Board (1, new List<string> {"收集水晶，到达法阵！"}, new List<string> {
					"56,57,56,56,56,57,57,,51,51,52,52,53,51,51"
					, "59,0,3,0,0,56,56,,51,0,0,0,3,0,0"
					, "56,0,0,0,0,56,56,,52,0,0,0,0,0,0"
					, "56,0,0,57,56,56,56,,52,51,0,54,0,52,0"
					, "56,0,0,58,0,2,57,,51,2,0,0,0,52,0"
					, "57,0,0,58,0,58,56,,52,0,0,0,0,52,0"
					, "57,0,0,0,0,58,56,,52,0,0,53,0,0,0"
					, "56,56,59,0,0,0,1,,1,0,0,0,0,54,53"}));
		
		boardDic.Add (2, new Board (2, new List<string> {"石球可以打破栅栏！"}, new List<string> {
			"66,66,66,66,67,66,66,,61,61,62,61,62,61,61"
				,"67,0,3,0,0,66,66,,62,0,0,0,3,0,61"
					,"66,0,0,0,66,66,66,,61,0,62,0,0,0,0"
					,"66,31,0,0,66,2,67,,62,2,62,62,0,0,0"
					,"66,0,67,67,0,0,66,,62,61,61,0,0,0,62"
					,"67,0,41,0,0,67,66,,62,61,61,40,0,0,0"
					,"66,0,0,0,67,2,66,,61,2,30,0,0,0,0"
			,"66,66,1,0,0,0,66,,61,61,61,0,1,0,0"}));

		boardDic.Add (3, new Board (3, new List<string> {"可以通过龙卷风移动！"}, new List<string> {
			"100,100,100,100,100,100,100,,100,100,100,100,100,100,100"
				,"100,100,0,3,100,100,100,,100,100,100,2,100,100,100"
					,"100,100,0,0,0,100,100,,100,0,100,0,0,100,100"
					,"0,0,76,0,0,0,100,,100,11,0,0,100,0,0"
					,"10,1,77,0,78,0,100,,100,0,100,100,100,1,11"
					,"0,0,100,100,0,10,100,,100,0,0,0,100,0,0,"
					,"100,100,0,2,0,0,100,,100,0,0,3,0,100,100"
			,"100,100,100,100,100,100,100,,100,100,0,100,100,100,100"}));
	}

	public Board GetBoardByLevel (int level) {
		return boardDic [level];
	}

	public void Completed (int level) {
		MaxLevel = Mathf.Max (level + 1, MaxLevel);
	}
}